package com;

public class Menu {
	
	
	
	
	public  void mainMenu() {
		prt("*************************");
		prt("**      1.添加记录             **");
		prt("**      2.查找记录             **");
		prt("**      3.修改记录             **");
		prt("**      4.删除记录             **");
		prt("**      5.排序记录             **");
		prt("**      6.退出系统             **");
		prt("*************************");
		
	}
	public void addMenu() {
		prt("*************************");
		prt("**      1.添加新记录         **");
		prt("**      2.查看全记录         **");
		prt("**      3.返回上一级         **");
		prt("*************************");
		
	}
	
	public  void deleteMenu() {
		prt("*************************");
		prt("**      1.查看全记录              **");
		prt("**      2.删除单个记录          **");
		prt("**      3.删除所有                  **");
		prt("**      4.返回上一层              **");
		prt("*************************");
	}
	
	public  void modifyMenu() {
		prt("*************************");
		prt("**      1.查看全记录         **");
		prt("**      2.修改指定记录     **");
		prt("**      3.返回上一级         **");
		prt("*************************");
	}
	public  void modifyMenu2() {
		prt("*************************");
		prt("**      1.修改姓名             **");
		prt("**      2.修改年龄             **");
		prt("**      3.修改性别             **");
		prt("**      4.修改号码             **");
		prt("**      5.修改住址             **");
		prt("**      6.返回上一级         **");
		prt("*************************");
	}
	public  void searchMenu() {
		prt("*************************");
		prt("**      1.按姓名查找         **");
		prt("**      2.按年龄查找         **");
		prt("**      3.按性别查找         **");
		prt("**      4.按号码查找         **");
		prt("**      5.按住址查找         **");
		prt("**      6.查看全记录         **");
		prt("**      7.返回上一级         **");
		prt("*************************");
	}
	public  void orderMenu(){
		prt("*************************");
		prt("**      1.按姓名排序         **");
		prt("**      2.按年龄排序         **");
		prt("**      3.按性别排序         **");
		prt("**      4.查看全记录         **");
		prt("**      5.返回上一级         **");
		prt("*************************");
	}
	public static void prt(String s) {
		System.out.println(s);
		
		
	}



}
